<template>
  <div class="characters">
    <h1>Энакин Скайуокер</h1>
    <p>Энакин Скайуокер (Хейден Кристенсен) — один из главных, если не главный, персонаж всей саги. Будучи рыцарем-джедаем огромной силы, членом Совета Джедаев, Командором и Верховным Генералом Республиканской армии, слишком сблизился с канцлером Палпатином, оказавшимся темным владыкой ситхов, и перешёл на Тёмную сторону. В обличьи владыки Дарта Вейдера уничтожил всех юнлингов джедайской академии, пытался убить бывшего учителя Оби-Вана Кеноби, но проиграл, получив почти смертельные повреждения, почти задушил возлюбленную и жену Падме. Позднее помогал поддерживать верховенство Империи в галактике. Убил своего бывшего учителя Кеноби, пытался как убить, так и переманить на темную сторону своего сына Люка Скайуокера. В итоге, спасая его жизнь, убил Императора, перешел на Светлую сторону и слился с Силой. Появляется во всех шести эпизодах первых двух трилогий, а также в спин-оффе</p>
    
    <h1>Люк Скайуокер</h1>
    <p>Люк Скайуокер (Марк Хэмилл) — один из главных персонажей всей саги, мастер-джедай, гранд-мастер Нового Ордена джедаев, сын Энакина Скайуокера, брат принцессы Леи Органы. После рождения был спрятан Оби-Ваном на планете Татуин, чтобы его не нашел Дарт Вейдер. Позднее Оби-Ван снова нашел его и начал обучать Силе. Дважды сошелся в бою с родным отцом, в первом бою на световых мечах потерял руку, во втором победил его, но не стал убивать, чтобы не переходить на Темную сторону. Спас отца для Света, когда тот, защищая его, убил Императора. В третьей трилогии стал учителем Рей, а также сражался со своим бывшим учеником Кайло Реном, который перешел на Темную сторону. Слился с Силой в эпизоде 8.</p>
    <img class= "" src="https://media.contentapi.ea.com/content/dam/star-wars-battlefront-2/images/2019/08/swbf2-refresh-hero-large-heroes-page-luke-skywalker-16x9-xl.jpg.adapt.crop1x1.320w.jpg" alt="Люк Скайоукер">
    <h1>Йода</h1>
    <p>Йода (Фрэнк Оз) — гранд мастер-джедай, по мнению многих, один из самых сильных и мудрых джедаев. Один из самых старых членов Совета. Учитель графа Дуку, Квай-Гона Джинна, Люка Скайуокера и очень большого количества джедаев разной степени важности в саге. По его собственному мнению, получил поражение в бою с Дартом Сидиусом, а потому ушел в добровольное изгнание, в котором и приступил к обучению Люка Скайуокера. Слился с Силой в эпизоде 5. Появляется также в эпизодах 1, 2, 3 и 6.</p>
  
    <h1>Палпатин</h1>
    <p>Палпатин (Иан Макдермид) — канцлер Республики, оказавшийся темным владыкой ситхов Дартом Сидиусом. Позднее стал Императором и возглавил темную Империю, погрузившую галактику во Зло. Является главным антагонистом всей саги. Подчинил Энакина Скайуокера Темной стороне, убил Мейса Винду, по его приказу также убили огромное количество джедаев и всех юнлингов из академии. Кроме того, предавал и убивал своих же учеников и учителей – графа Дуку и, предположительно, Дарта Плэгаса Мудрого. Погиб в эпизоде 6, когда Дарт Вейдер снова вернулся на Светлую сторону, спасая сына, Люка Скайуокера.</p>

    <h1>Оби-Ван Кеноби</h1>
    <p>Оби-Ван «Бен» Кеноби (Алек Гиннесс, Юэн Макгрегор) — один из самых значимых персонажей саги. Мастер-джедай, магистр Совета Джедаев, Верховный генерал Республики. Его наставниками были Квай-Гон Джинн и Йода, сам он обучал Энакина и Люка Скайуокеров. В финале второй трилогии он победил в бою на световых мечах Энакина Скайуокера, перешедшего на Темную сторону, в результате чего последнего пришлось подключать к системе жизнеобеспечения – позднее его новый внешний вид стал неотъемлемой частью восприятия Дарта Вейдера. В первой трилогии Оби-Ван добровольно проигрывает бой Вейдеру, сливаясь с силой.</p>

    <h1>Хан Соло</h1>
    <p>Хан Соло (Харрисон Форд) — генерал Альянса повстанцев, ранее контрабандист, капитан космического корабля «Тысячелетний Сокол». Возлюбленный и муж принцессы Леи Органы, отец Бена Соло, джедая, перешедшего на Темную сторону под именем Кайло Рен. В оригинальной трилогии был одним из центральных персонажей и непосредственно повлиял на падение Империи, сражаясь в рядах повстанцев и помогая своему другу Люку Скайуокеру. В третьей трилогии был убит собственным сыном при попытке вернуть его на Светлую сторону.</p>
  
    <h1>Лея Органа</h1>
    <p>Лея Органа (Кэрри Фишер) – принцесса Алдераана, приемная дочь Бэйла Органа и королевы Брехи, дочь Энакина Скайуокера и Падме Амидалы. Многолетний лидер сопротивления, жена Хана Соло и сестра Люка Скайуокера. Джедай. Появлялась в 4-6 и 7-9 эпизодах.</p>
  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>